OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
/**************************************************************************//**
 * @file     CommandHandler.c
 * @version  V3.00
 * @brief    Secure ISP - Process commands
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2025 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#include <arm_cmse.h>
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"
#include "CommandHandler.h"

//#define DBG             printf
//#define DUMP_PACKET     1
#define CMD_DBG         printf

#ifndef DBG
    #define DBG(...)
#endif

#define LIB_VERSION     (0x23551171UL) // 2355 + 'M' + 'DD' + IDX ... 1st released

uint32_t CMDLIB_VERSION(void)
{
    return LIB_VERSION;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Miscellaneous Constant Definitions                                                                      */
/*---------------------------------------------------------------------------------------------------------*/
#define CURVE_P_SIZE        CURVE_P_256     /* ECC key length */
#define ECC_KEY_SIZE        256             /* 256-bits */
#define ALL_ONE_2PAGE_CHKS  0xB4293435      /* 2 page all 0xFF CRC32 checksum value */

void Hex2Reg(char input[], uint32_t volatile reg[]);
void Reg2Hex(int32_t count, uint32_t volatile reg[], char output[]);

static uint32_t GetMaxAPROMSize(void)
{
    return FMC_APROM_SIZE;
}

static uint8_t B2C(uint8_t c)
{
    if (c < 10)
        return (c + '0');

    if (c < 16)
        return (c - 10 + 'a');

    return 0;
}

static uint32_t Swap32(uint32_t value)
{
    volatile uint32_t val;

    /* __REV(x), byte swap32 for keil project */

    val = (value << 24) | ((value << 8) & 0xff0000) | ((value >> 8) & 0xff00) | (value >> 24);
    return val;
}

void BytesSwap(char *buf, int32_t len)
{
    int32_t i;
    char    tmp;

    for (i = 0; i < (len / 2); i++)
    {
        tmp = buf[len - i - 1];
        buf[len - i - 1] = buf[i];
        buf[i] = tmp;
    }
}

/**
  * @brief      Open SHA encrypt function
  * @param[in]  start       SHA encrypt start address
  * @param[in]  end         SHA encrypt end address
  * @param[out] digest      The SHA encrypt output digest
  * @param[in]  mode        SHA operation mode, including:
  *                             - \ref SHA_ONESHOT
  *                             - \ref SHA_CONTI_START
  *                             - \ref SHA_CONTI_ING
  *                             - \ref SHA_CONTI_END
  * @retval     0           Success
  * @retval     -1          Failed
  */
int32_t CalculateSHA256(uint32_t start, uint32_t end, uint32_t digest[], E_SHA_OP_MODE mode, E_SHA_SRC src)
{
    volatile int32_t    i, bytes;
    uint32_t            *ptr, u32Addr, data = 0, Hash[8];

    bytes   = end - start;
    ptr     = (uint32_t *)start;
    u32Addr = (uint32_t)ptr;

    if ((mode == SHA_ONESHOT) || (mode == SHA_CONTI_START))
    {
        DBG("\n[Start SHA256 from 0x%x to 0x%x. (size: %d) (mode: %d)] (%s)\n", start, end, bytes, mode, (src == SHA_SRC_SRAM) ? "SRAM" : "Flash");

        //CRYPTO->HMAC_CTL = (SHA_MODE_SHA256 << CRYPTO_HMAC_CTL_OPMODE_Pos) | CRYPTO_HMAC_CTL_INSWAP_Msk;
        // Sync output byte order with PC
        CRYPTO->HMAC_CTL = (SHA_MODE_SHA256 << CRYPTO_HMAC_CTL_OPMODE_Pos) | CRYPTO_HMAC_CTL_INSWAP_Msk | CRYPTO_HMAC_CTL_OUTSWAP_Msk;
        CRYPTO->HMAC_DMACNT = 64;
        CRYPTO->HMAC_CTL |= CRYPTO_HMAC_CTL_START_Msk;
    }
    else
    {
        DBG("[Continue SHA256 from 0x%x to 0x%x. (size: %d) (mode: %d)]\n", start, end, bytes, mode);
    }

    /* Start to calculate ... */
    while (bytes > 0)
    {
        if (bytes < 64)
            CRYPTO->HMAC_DMACNT = bytes;

        if (CRYPTO->HMAC_STS & CRYPTO_HMAC_STS_DATINREQ_Msk)
        {
            if (src == SHA_SRC_SRAM)
            {
                data = *ptr++;
                bytes -= 4;
            }
            else if (src == SHA_SRC_FLASH)
            {
                /* NOT Support calculate XOM region */
                if (u32Addr < FMC_VECMAP_SIZE)
                    data = FMC_Read((u32Addr & 0x0FFFFFFF)); /* First FMC_VECMAP_SIZE using FMC ISP read command */
                else
                    data = inpw((u32Addr & 0x0FFFFFFF));

                u32Addr += 4;
                bytes -= 4;
            }

            if (bytes <= 0)
                bytes = 0;

            /* bytes means remain byte counts */
            if (bytes != 0)
            {
                CRYPTO->HMAC_DATIN = data;
            }
            else
            {
                if ((mode == SHA_ONESHOT) || (mode == SHA_CONTI_END)) /* The last SHA operation */
                {
                    /* It's last word ... *-* */
                    CRYPTO->HMAC_CTL |= CRYPTO_HMAC_CTL_START_Msk | CRYPTO_HMAC_CTL_DMALAST_Msk;
                    CRYPTO->HMAC_DATIN = data;

                    while (CRYPTO->HMAC_STS & CRYPTO_HMAC_STS_BUSY_Msk);

                    for (i = 0; i < 8; i++)
                    {
                        uint32_t u32DGST = CRYPTO->HMAC_DGST[i];

                        Hash[i] = u32DGST;
                    }

                    memcpy(digest, Hash, sizeof(Hash));
                    DBG("\t[SHA256 done]\n");
                    break;
                }
                else
                {
                    CRYPTO->HMAC_DATIN = data;
                    /* Exit to wait next SHA operation */
                }
            }
        }
    }

    return 0;
    /*
        Verify:
            Input:
                    String char -> "32107654" on PC tool
                    HEX byte    -> "3332313037363534" on PC tool and {0x30313233,0x34353637} in device
            Result:
                6952CF8EACE972CD4F10567331B46D85104E9E57402364F205876D13F84F7E42
                ==> Arraty {0x6952CF8E, 0xACE972CD, 0x4F105673....}
    */
}

/*
    * CCITT (0xFFFF)
    * mode: 0: calculate; 1: verify
*/
static uint16_t PACKET_ExecCCITT(uint32_t *pu32buf, uint16_t u32ByteCnt, uint8_t u8Mode)
{
    uint16_t   i;
    uint16_t   *pu16buf, u16OrgSum, u16CalSum;

    if (u32ByteCnt > 56)   // Invalid data byte count
        return -1;

    pu16buf = (uint16_t *)pu32buf;

    CLK_EnableModuleClock(CRC0_MODULE);
    CRC_Open(CRC_CCITT, 0, 0xFFFFul, CRC_CPU_WDATA_16);

