OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
    for (i = 1; i < (u32ByteCnt / 2); i++)
    {
#if (0)
        DBG("idx-%d: 0x%04x (CCITT)\n", i, pu16buf[i]);
#endif
        CRC_WRITE_DATA(pu16buf[i]);
    }

    u16OrgSum = pu16buf[0];
    u16CalSum = CRC_GetChecksum();

    /* Clear CRC checksum and reset seed */
    CRC_SET_SEED(0xFFFF);

    if (u8Mode == 0)
    {
        pu16buf[0] = u16CalSum;
        return u16CalSum;
    }
    else if (u8Mode == 1)
    {
        /* Verify CCITT checksum */
        if (u16OrgSum == u16CalSum)
            return 0;   /* Verify CCITT Pass */
        else
        {
            //DBG("u16OrgSum: 0x%08X, u16CalSum: 0x%08X\n", u16OrgSum, u16CalSum);
            return -1;  /* Verify CCITT Fail */
        }
    }
    else
    {
        return -1;
    }
}

/*
    * CRC32
    * mode: 0: calculate; 1: verify
*/
static uint32_t PACKET_ExecCRC32(uint32_t *pu32buf, uint16_t len, uint8_t mode)
{
    uint16_t i;
    uint32_t u32OrgSum, u32CalSum;

    if (len > 60) // valid data byte count
        return -1;

    CLK_EnableModuleClock(CRC0_MODULE);
    CRC_Open(CRC_32, (CRC_WDATA_RVS | CRC_CHECKSUM_COM | CRC_CHECKSUM_RVS), 0xFFFFFFFFul, CRC_CPU_WDATA_32);

    for (i = 0; i < (len / 4) - 1; i++)
    {
#if (0)
        DBG("idx-%d: 0x%08x. (CRC32)\n", i, pu32buf[i]);
#endif
        CRC_WRITE_DATA(pu32buf[i]);
    }

    u32OrgSum = pu32buf[i];
    u32CalSum = CRC_GetChecksum();

    /* Clear CRC checksum and reset seed */
    CRC_SET_SEED(0xFFFFFFFF);

    if (mode == 0)
    {
        pu32buf[i] = u32CalSum;
        return u32CalSum;
    }
    else if (mode == 1)
    {
        /* Verify CRC32 checksum */
        if (u32OrgSum == u32CalSum)
            return 0;   /* Verify CRC32 Pass */
        else
            return -1;  /* Verify CRC32 Fail */
    }
    else
    {
        return -1;
    }
}

/**
  * @brief      Perform AES-256 CFB NoPadding encrypt
  */
static int32_t PACKET_AES256Encrypt(uint32_t *in, uint32_t *out, uint32_t len, uint32_t *KEY, uint32_t *IV)
{
    int32_t i32TimeOutCnt;

#if (NVT_DCACHE_ON == 1)
    /*
     * Note: Cache coherence handling
     * If 'in' or 'out' buffers are located in cacheable memory (e.g. AXI SRAM) and D-Cache is enabled,
     * you MUST ensure cache coherency before DMA starts:
     *   SCB_CleanDCache_by_Addr((void *)in, len);
     *   SCB_CleanDCache_by_Addr((void *)out, len);
     * In this example, the buffers are allocated on the stack (DTCM), which is
     * non-cacheable by default in this BSP. Therefore, cache maintenance is not required here.
     */
#endif

    AES_CLR_INT_FLAG(CRYPTO);
    AES_Open(CRYPTO, 0, 1, AES_MODE_CFB, AES_KEY_SIZE_256, AES_IN_OUT_SWAP);
    AES_SetKey(CRYPTO, 0, KEY, 4 * 8);
    AES_SetInitVect(CRYPTO, 0, IV);
    AES_SetDMATransfer(CRYPTO, 0, (uint32_t)in, (uint32_t)out, len);
    AES_Start(CRYPTO, 0, CRYPTO_DMA_ONE_SHOT);

    i32TimeOutCnt = SystemCoreClock; /* > 1 second time-out */

    while (AES_GET_INT_FLAG(CRYPTO) == 0)
    {
        if (i32TimeOutCnt-- < 0)
            return -1;
    }

    if (AES_GET_INT_FLAG(CRYPTO) & CRYPTO_INTSTS_AESEIF_Msk)
    {
        AES_CLR_INT_FLAG(CRYPTO);
        return -2;
    }

    AES_CLR_INT_FLAG(CRYPTO);

#if (NVT_DCACHE_ON == 1)
    /*
     * Note: Cache coherence handling
     * If 'out' buffer is located in cacheable memory, you MUST invalidate the cache after DMA completes:
     *   SCB_InvalidateDCache_by_Addr((void *)out, len);
     * Since this example uses stack (DTCM) buffers, this state invalidation is skipped.
     */
#endif

    return 0;
}

/**
  * @brief      Perform AES-256 CFB NoPadding decrypt
  */
static int32_t PACKET_AES256Decrypt(uint32_t *in, uint32_t *out, uint32_t len, uint32_t *KEY, uint32_t *IV)
{
    int32_t i32TimeOutCnt;

#if (NVT_DCACHE_ON == 1)
    /*
     * Note: Cache coherence handling
     * If 'in' or 'out' buffers are located in cacheable memory (e.g. AXI SRAM) and D-Cache is enabled,
     * you MUST ensure cache coherency before DMA starts:
     *   SCB_CleanDCache_by_Addr((void *)in, len);
     *   SCB_CleanDCache_by_Addr((void *)out, len);
     * In this example, the buffers are allocated on the stack (DTCM), which is
     * non-cacheable by default in this BSP. Therefore, cache maintenance is not required here.
     */
#endif

    AES_CLR_INT_FLAG(CRYPTO);
    AES_Open(CRYPTO, 0, 0, AES_MODE_CFB, AES_KEY_SIZE_256, AES_IN_OUT_SWAP);
    AES_SetKey(CRYPTO, 0, KEY, 4 * 8);
    AES_SetInitVect(CRYPTO, 0, IV);
    AES_SetDMATransfer(CRYPTO, 0, (uint32_t)in, (uint32_t)out, len);
    AES_Start(CRYPTO, 0, CRYPTO_DMA_ONE_SHOT);

    i32TimeOutCnt = SystemCoreClock; /* > 1 second time-out */

    while (AES_GET_INT_FLAG(CRYPTO) == 0)
    {
        if (i32TimeOutCnt-- < 0)
            return -1;
    }

    if (AES_GET_INT_FLAG(CRYPTO) & CRYPTO_INTSTS_AESEIF_Msk)
    {
        AES_CLR_INT_FLAG(CRYPTO);
        return -2;
    }

    AES_CLR_INT_FLAG(CRYPTO);

#if (NVT_DCACHE_ON == 1)
    /*
     * Note: Cache coherence handling
     * If 'out' buffer is located in cacheable memory, you MUST invalidate the cache after DMA completes:
     *   SCB_InvalidateDCache_by_Addr((void *)out, len);
     * Since this example uses stack (DTCM) buffers, this state invalidation is skipped.
     */
#endif

    return 0;
}

int32_t CMD_GenRspPacket(CMD_PACKET_T *pCMD, ISP_INFO_T *pISPInfo)
{
    uint32_t    i;

    /* Generate CCITT */
    PACKET_ExecCCITT((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 8, 0);

    for (i = 0; i < sizeof(pISPInfo->au32AESKey) / 4; i++)
    {
        if (pISPInfo->au32AESKey[i] != 0x0ul)
            break;
    }

    /* if i == 8, NO AES key, do not encrypt the cmd data */
    if (i != 8)
    {
        if (PACKET_AES256Encrypt(pCMD->au32Data, pCMD->au32Data, sizeof(pCMD->au32Data), pISPInfo->au32AESKey, pISPInfo->au32AESIV) != 0)
        {
            printf("PACKET_AES256Encrypt failed !\n");
            return -1;
        }
    }

#if (DUMP_PACKET == 1)
    {
        uint32_t *pu32;
        pu32 = (uint32_t *)pCMD;
        DBG("AES KEY:\n");

        for (i = 0; i < sizeof(pISPInfo->au32AESKey) / 4; i++)
            DBG("   0x%08x", pISPInfo->au32AESKey[i]);

        DBG("\nAES IV:\n");

        for (i = 0; i < sizeof(pISPInfo->au32AESIV) / 4; i++)
            DBG("   0x%08x", pISPInfo->au32AESIV[i]);

        DBG("\nRSP data(encryption?):\n");

        for (i = 0; i < 2; i++)
            DBG("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                DBG("\n");

            DBG("   0x%08x", pu32[i]);
        }

