OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
        DBG("\n");
    }
#endif

    /* Generate CRC32 */
    PACKET_ExecCRC32((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 4, 0);

#if (DUMP_PACKET == 1)
    {
        uint32_t *pu32 = (uint32_t *)pCMD;

        NVT_UNUSED(pu32);

        if (i != 8)
        {
            DBG("AES KEY:\n");

            for (i = 0; i < sizeof(pISPInfo->au32AESKey) / 4; i++)
                DBG("   0x%08x", pISPInfo->au32AESKey[i]);

            DBG("\nAES IV:\n");

            for (i = 0; i < sizeof(pISPInfo->au32AESIV) / 4; i++)
                DBG("   0x%08x", pISPInfo->au32AESIV[i]);

            DBG("\n");
        }

        DBG("Send RSP data:\n");

        for (i = 0; i < 2; i++)
            DBG("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                DBG("\n");

            DBG("   0x%08x", pu32[i]);
        }

        DBG("\n");
    }
#endif

    return 0;
}

int32_t CMD_ParseReqPacket(CMD_PACKET_T *pCMD, ISP_INFO_T *pISPInfo)
{
    uint32_t i;

#if (DUMP_PACKET == 1)
    {
        uint32_t *pu32 = (uint32_t *)pCMD;
        printf("Get REQ data:\n");

        for (i = 0; i < 2; i++)
            printf("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                printf("\n");

            printf("   0x%08x", pu32[i]);
        }

        printf("\n");
    }
#endif

    /* verify CRC32 */
    if (PACKET_ExecCRC32((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 4, 1) != 0)
    {
        DBG("\n\tPacket CRC32 mismatch!\n");
        return -1;
    }

    for (i = 0; i < sizeof(pISPInfo->au32AESKey) / 4; i++)
    {
        if (pISPInfo->au32AESKey[i] != 0x0ul)
            break;
    }

    /* if i == 8, NO AES key, do not decrypt the cmd data */
    if (i != 8)
    {
        if (PACKET_AES256Decrypt(pCMD->au32Data, pCMD->au32Data, sizeof(pCMD->au32Data), pISPInfo->au32AESKey, pISPInfo->au32AESIV) != 0)
        {
            printf("PACKET_AES256Decrypt failed !\n");
            return -2;
        }
    }

#if (DUMP_PACKET == 1)
    {
        uint32_t *pu32 = (uint32_t *)pCMD;

        NVT_UNUSED(pu32);

        if (i != 8)
        {
            DBG("AES KEY:\n");

            for (i = 0; i < sizeof(pISPInfo->au32AESKey) / 4; i++)
                DBG("   0x%08x", pISPInfo->au32AESKey[i]);

            DBG("\nAES IV:\n");

            for (i = 0; i < sizeof(pISPInfo->au32AESIV) / 4; i++)
                DBG("   0x%08x", pISPInfo->au32AESIV[i]);

            DBG("\n");
        }

        DBG("[Decrypt] Get REQ data:\n");

        for (i = 0; i < 2; i++)
            DBG("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                DBG("\n");

            DBG("   0x%08x", pu32[i]);
        }

        DBG("\n");
    }
#endif

    /* verify CCITT */
    if (PACKET_ExecCCITT((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 8, 1) != 0)
    {
        DBG("\n\tPacket CCITT mismatch !\n");
        return -1;
    }

    DBG("Parse cmd Pass.\n\n");
    return 0;
}

void CommandHandlerInit(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Enable FMC ISP */
    FMC_ENABLE_ISP();
    FMC_DISABLE_AP_UPDATE();
    FMC_DISABLE_LD_UPDATE();
    FMC_DISABLE_CFG_UPDATE();

    /* Enable CRYPTO and TRNG clock */
    CLK_EnableModuleClock(CRYPTO0_MODULE);
    CLK_EnableModuleClock(TRNG0_MODULE);
    /* Enable ECC IRQ */
    ECC_ENABLE_INT(CRYPTO);
    NVIC_EnableIRQ(CRYPTO_IRQn);
    /* Initial Random Number Generator */
    RNG_Open();
}

static int32_t GenRandomIV(ISP_INFO_T *pISPInfo)
{
    uint32_t    au32Buf[8];

    if (RNG_Random(au32Buf, 8) == 0)
        return -1;

    memcpy(pISPInfo->au32AESIV, au32Buf, (128 / 8)); // size is 128-bit

    return 0;
}

/*
    Stage 1.
    Valid commands:
        "CMD_RESYNC"     "CMD_CONNECT"   "CMD_DISCONNECT"
*/
int32_t ParseCONNECT(ISP_INFO_T *pISPInfo)
{
    /* The CMD_PACKET_T is allocated on the Stack. Since the Stack is default mapped to DTCM in BSP,
       any memory accesses bypass the D-Cache, naturally avoiding cache coherence issues. */
    CMD_PACKET_T        cmd;
    volatile int32_t    i, ret = 0, cmd_case;
    uint32_t            u32Data;

    memset(&cmd,             0x0, sizeof(CMD_PACKET_T));
    memset(pISPInfo->rspbuf, 0x0, sizeof(pISPInfo->rspbuf));

    memcpy(&cmd, pISPInfo->rcvbuf, sizeof(cmd));

    do
    {
        /* plaint text cmd */
        if (cmd.u16CmdID == CMD_RESYNC)
        {
            cmd.au32Data[0] = STS_OK;
            cmd.u16Len      = (4 * 1);
            ret = cmd.u16CmdID;
            pISPInfo->IsConnectOK = 0;
            break;
        }

        if (CMD_ParseReqPacket(&cmd, pISPInfo) != 0)
        {
            CMD_DBG("*** [Parse error: 0x%x] ***\n", cmd.u16CmdID);
            memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

            cmd.au32Data[0] = ERR_CMD_CHECKSUM;
            cmd.u16Len      = (4 * 1);
            ret = -1;
            break;
        }
        else
        {
            cmd_case = cmd.u16CmdID;

            switch (cmd_case)
            {
                case CMD_DISCONNECT:
                    CMD_DBG("[CMD_DISCONNECT] (stage 1)\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    pISPInfo->IsConnectOK = 0;
                    break;

                case CMD_CONNECT:
                    CMD_DBG("[CMD_CONNECT] (stage 1)\n");

                    for (i = 0; i < 4; i++)
                    {
                        u32Data = Swap32(cmd.au32Data[i]);
                        pISPInfo->au32AESIV[i] = u32Data;
                    }

                    for (i = 0; i < 4; i++)
                    {
                        if (pISPInfo->au32AESIV[i] != 0)
                            break;
                    }

                    if (i == 4)
                    {
                        /* NO AESIV. Client will generate a new random AES IV */
                        GenRandomIV(pISPInfo);
                    }

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.au32Data[1] = SYS->PDID;

