OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    pISPInfo->IsConnectOK = 0;
                    break;

                case CMD_ECDH_PUB0:
                    CMD_DBG("[CMD_ECDH_PUB0]\n");
                    /* Get Server public key 0 */
                    memcpy(pISPInfo->ServerPubKey.au32Key0, cmd.au32Data, cmd.u16Len);

                    for (i = 0; i < 8; i++)
                        DBG("Get pub0[%d]: 0x%08x.\n", i, pISPInfo->ServerPubKey.au32Key0[i]);

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ECDH_PUB1:
                    CMD_DBG("[CMD_ECDH_PUB1]\n");
                    /* Get Server public key 1 and generate ist ECDH AES key */
                    memcpy(pISPInfo->ServerPubKey.au32Key1, cmd.au32Data, cmd.u16Len);

                    for (i = 0; i < 8; i++)
                        DBG("Get pub1[%d]: 0x%08x.\n", i, pISPInfo->ServerPubKey.au32Key1[i]);

                    /* TODO : user can identify server's public key here... */

                    if (pISPInfo->pfnGenKeyFunc == 0)
                    {
                        cmd.au32Data[0] = ERR_PARAMETER;
                        cmd.u16Len      = (4 * 1);
                        ret = -1;
                        break;
                    }

                    if (pISPInfo->pfnGenKeyFunc(&pISPInfo->ServerPubKey, AESKey) != 0)
                    {
                        cmd.au32Data[0] = ERR_PARAMETER;
                        cmd.u16Len      = (4 * 1);
                        ret = -1;
                        break;
                    }

                    //                    /* Generate 1st ECDH AES key */
                    //                    Hex2Reg((char *)gacPrivKey,  priv);
                    //                    BytesSwap((char *)priv, sizeof(priv)); // 256-bits
                    //                    if(GenECDHKey(priv, &pISPInfo->ServerPubKey, AESKey) != 0)
                    //                    {
                    //                        cmd.au32Data[0] = ERR_PARAMETER;
                    //                        cmd.u16Len      = (4 * 1);
                    //                        ret = -1;
                    //                        break;
                    //                    }
                    for (i = 0; i < 8; i++)
                    {
                        u32Data = Swap32(AESKey[i]);
                        AESKey[i] = u32Data;
                    }

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ECDH_GET_PUB0: // MUST be encrypted
                    CMD_DBG("[CMD_ECDH_GET_PUB0]\n");
                    /* Response encrypted Client public key 0 */
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    memcpy(&cmd.au32Data[1], pISPInfo->ClientPubKey.au32Key0, sizeof(pISPInfo->ClientPubKey.au32Key0));

                    for (i = 0; i < 8; i++)
                        DBG("Out pub0[%d]: 0x%08x.\n", i, cmd.au32Data[1 + i]);

                    cmd.u16Len      = (4 * (1 + 8));
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ECDH_GET_PUB1: // MUST be encrypted
                    CMD_DBG("[CMD_ECDH_GET_PUB1]\n");
                    /* Response encrypted Client public key 1 */
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    memcpy(&cmd.au32Data[1], pISPInfo->ClientPubKey.au32Key1, sizeof(pISPInfo->ClientPubKey.au32Key1));

                    for (i = 0; i < 8; i++)
                        DBG("Out pub1[%d]: 0x%08x.\n", i, cmd.au32Data[1 + i]);

                    cmd.u16Len      = (4 * (1 + 8));
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ECDH_RAND_PUB0: // MUST be encrypted
                    CMD_DBG("[CMD_ECDH_RAND_PUB0]\n");
                    /* Get Server random public key 0 */
                    memcpy(pISPInfo->ServerPubKey.au32Key0, cmd.au32Data, cmd.u16Len);

                    for (i = 0; i < 8; i++)
                        DBG("Get rand_pub0[%d]: 0x%08x.\n", i, pISPInfo->ServerPubKey.au32Key0[i]);

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ECDH_RAND_PUB1: // MUST be encrypted
                    CMD_DBG("[CMD_ECDH_RAND_PUB1]\n");
                    /* Get Server random public key 1 */
                    memcpy(pISPInfo->ServerPubKey.au32Key1, cmd.au32Data, cmd.u16Len);

                    for (i = 0; i < 8; i++)
                        DBG("Get rand_pub1[%d]: 0x%08x.\n", i, pISPInfo->ServerPubKey.au32Key1[i]);

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ECDH_GET_RAND_PUB0: // MUST be encrypted
                    CMD_DBG("[CMD_ECDH_GET_RAND_PUB0]\n");

                    /* Generate Client random ECC key pair */
                    if (GenRandomECCKeyPair(priv, &randpub) != 0)
                    {
                        memset(priv, 0x0, sizeof(priv));
                        memset(&randpub, 0x0, sizeof(ECC_PUBKEY_T));
                        cmd.au32Data[0] = ERR_PARAMETER;
                        cmd.u16Len      = (4 * 1);
                        ret = -1;
                        break;
                    }

                    /* Generate 2nd ECDH AES key and update in CMD_ECDH_RSP_RAND_PUB1 cmd */
                    if (GenECDHKey(priv, &pISPInfo->ServerPubKey, AESKey) != 0)
                    {
                        cmd.au32Data[0] = ERR_PARAMETER;
                        cmd.u16Len      = (4 * 1);
                        ret = -1;
                        break;
                    }

