OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
                    for (i = 0; i < 8; i++)
                    {
                        u32Data = Swap32(AESKey[i]);
                        AESKey[i] = u32Data;
                    }

                    memcpy(pISPInfo->tmp0, AESKey, sizeof(AESKey));

                    memcpy(pISPInfo->ClientPubKey.au32Key0, randpub.au32Key0, sizeof(randpub.au32Key0));
                    memcpy(pISPInfo->ClientPubKey.au32Key1, randpub.au32Key1, sizeof(randpub.au32Key1));
                    memset(priv, 0x0, sizeof(priv));
                    memset(&randpub, 0x0, sizeof(ECC_PUBKEY_T));

                    /* Response encrypted Client random public key 0 */
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    memcpy(&cmd.au32Data[1], pISPInfo->ClientPubKey.au32Key0, sizeof(pISPInfo->ClientPubKey.au32Key0));

                    for (i = 0; i < 8; i++)
                        DBG("Out rand_pub0[%d]: 0x%08x.\n", i, cmd.au32Data[1 + i]);

                    cmd.u16Len      = (4 * (1 + 8));
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ECDH_GET_RAND_PUB1: // MUST be encrypted
                    CMD_DBG("[CMD_ECDH_GET_RAND_PUB1]\n");
                    /* Response encrypted Client random public key 1 */
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = STS_OK;
                    memcpy(&cmd.au32Data[1], pISPInfo->ClientPubKey.au32Key1, sizeof(pISPInfo->ClientPubKey.au32Key1));

                    for (i = 0; i < 8; i++)
                        DBG("Out rand_pub1[%d]: 0x%08x.\n", i, cmd.au32Data[1 + i]);

                    cmd.u16Len      = (4 * (1 + 8));
                    ret = cmd.u16CmdID;
                    break;

                default:
                    CMD_DBG("*** [Cmd error: 0x%x] ***\n", cmd.u16CmdID);
                    cmd.au32Data[0] = ERR_CMD_INVALID;
                    cmd.u16Len      = (4 * 1);
                    ret = -1;
                    break;
            }
        }

        if (ret == -1)
            pISPInfo->IsConnectOK = 0;
    } while (0);

    CMD_GenRspPacket(&cmd, pISPInfo);

    memcpy(pISPInfo->rspbuf, (uint8_t *)&cmd, sizeof(CMD_PACKET_T));

    if ((ret == CMD_ECDH_PUB1) || (ret == CMD_ECDH_GET_RAND_PUB1))
    {
        if (ret == CMD_ECDH_PUB1)
        {
            /* Update 1st ECDH AES key to pISPInfo */
            memcpy(pISPInfo->au32AESKey, AESKey, sizeof(AESKey));

            for (i = 0; i < 8; i++)
                DBG("Gen 1st ECDH AES KEY[%d]: 0x%08x.\n", i, pISPInfo->au32AESKey[i]);
        }
        else
        {
            /* Update 2nd ECDH AES key to pISPInfo */
            memcpy(pISPInfo->au32AESKey, pISPInfo->tmp0, sizeof(AESKey));

            for (i = 0; i < 8; i++)
                DBG("Gen 2nd ECDH AES KEY[%d]: 0x%08x.\n", i, pISPInfo->au32AESKey[i]);

            memset(pISPInfo->tmp0, 0x0, sizeof(AESKey));
        }
    }

    memset(AESKey, 0x0, sizeof(AESKey));

    DBG("Response.\n\n");
    return ret;
}

int32_t _PageErase(uint32_t u32Addr, uint32_t u32Count, uint32_t u32CmdMask)
{
    uint32_t i;
    int32_t  ret = -1;

    NVT_UNUSED(u32CmdMask);
    DBG("[Page erase] u32Addr: 0x%x, page counts: %d.\n", u32Addr, u32Count);

    u32Addr &= ~NS_OFFSET;

    /* Check address and counts */
    if (((u32Addr % FMC_FLASH_PAGE_SIZE) != 0) || (u32Count == 0))
        return ERR_PAGE_ALIGN;

    /* Not use u32CmdMask */
    //    /* Check for erase LDROM or APROM */
    //    if(u32Addr & FMC_LDROM_BASE)
    //    {
    //        if(u32CmdMask & MASK_UPDATE_LDROM)
    //            return CMD_IS_MASKED;
    //    }
    //    else
    //    {
    //        if(u32CmdMask & MASK_UPDATE_APROM)
    //            return CMD_IS_MASKED;
    //    }

    if ((u32Addr < GetMaxAPROMSize()) && (u32Addr >= FMC_APROM_BASE))
    {
        if (u32Count > (GetMaxAPROMSize() / FMC_FLASH_PAGE_SIZE))
            return ERR_OVER_RANGE;

        if ((u32Addr + (u32Count * FMC_FLASH_PAGE_SIZE)) > GetMaxAPROMSize())
            return ERR_OVER_RANGE;

        FMC_ENABLE_AP_UPDATE();
    }
    else if ((u32Addr < FMC_LDROM_END) && (u32Addr >= FMC_LDROM_BASE))
    {
        if (u32Count > (FMC_LDROM_SIZE / FMC_FLASH_PAGE_SIZE))
            return ERR_OVER_RANGE;

        if ((u32Addr + (u32Count * FMC_FLASH_PAGE_SIZE)) > FMC_LDROM_END)
            return ERR_OVER_RANGE;

        FMC_ENABLE_LD_UPDATE();
    }
    else
    {
        return ERR_OVER_RANGE;
    }

    for (i = 0; i < u32Count; i++)
    {
        ret = ERR_ISP_ERASE;

        /* perform erase page */
        if (FMC_Erase(u32Addr) < 0)
            break;

        /* Run 2 page checksum and verify its result */
        if (FMC_GetChkSum(u32Addr, FMC_FLASH_PAGE_SIZE) != ALL_ONE_2PAGE_CHKS)
            break;

        u32Addr += FMC_FLASH_PAGE_SIZE;
        ret = 0;
    }

    FMC_DISABLE_AP_UPDATE();
    FMC_DISABLE_LD_UPDATE();
    return ret;
}

static int32_t _IsValidFlashRegion(uint32_t u32Addr, uint32_t size, uint32_t u32CmdMask)
{
    NVT_UNUSED(u32CmdMask);
    DBG("[Check flash region] u32Addr: 0x%x, size: %d.\n", u32Addr, size);

    /* Not use u32CmdMask */

    u32Addr &= ~NS_OFFSET;

    /* Check address and length */
    if ((u32Addr % 4) != 0)
        return ERR_INVALID_ADDRESS;

    if (((size % 4) != 0) || (size == 0))
        return ERR_INVALID_ADDRESS;

    /* Not use u32CmdMask */
    //    /* Check for erase LDROM or APROM */
    //    if(u32Addr & FMC_LDROM_BASE)
    //    {
    //        if(u32CmdMask & MASK_UPDATE_LDROM)
    //            return CMD_IS_MASKED;
    //    }
    //    else
    //    {
    //        if(u32CmdMask & MASK_UPDATE_APROM)
    //            return CMD_IS_MASKED;
    //    }

    if ((u32Addr < GetMaxAPROMSize()) && (u32Addr >= FMC_APROM_BASE))
    {
        if (((u32Addr + size) > GetMaxAPROMSize()) || ((u32Addr + size) < u32Addr))
            return ERR_OVER_RANGE;

