OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/SecureISPDemo/ISPSource/CommandHandler.c
        FMC_ENABLE_AP_UPDATE();
    }
    else if ((u32Addr < FMC_LDROM_END) && (u32Addr >= FMC_LDROM_BASE))
    {
        if (((u32Addr + size) > FMC_LDROM_END) || ((u32Addr + size) < u32Addr))
            return ERR_OVER_RANGE;

        FMC_ENABLE_LD_UPDATE();
    }
    else
    {
        return ERR_OVER_RANGE;
    }

    return 0;
}

static int32_t _ISPWrite(uint32_t u32Addr, uint32_t u32Data)
{
    FMC_Write(u32Addr, u32Data);

    if (FMC_GET_FAIL_FLAG())
    {
        /* Clear ISPFF if cmd FAIL */
        FMC_CLR_FAIL_FLAG();
        return -1;
    }

    return 0;
}

static uint32_t _ISPRead(uint32_t u32Addr)
{
    uint32_t u32Data = FMC_Read(u32Addr);

    if (FMC_GET_FAIL_FLAG())
    {
        /* Clear ISPFF if cmd FAIL */
        FMC_CLR_FAIL_FLAG();
        return -1;
    }

    return u32Data;
}

static int32_t _WriteFlash(uint32_t u32Addr, uint32_t u32Size, uint32_t *pu32Data, uint32_t u32CmdMask)
{
    uint32_t i;
    int32_t ret = -1;

    DBG("[Write flash] u32Addr: 0x%x, u32Size: %d.\n", u32Addr, u32Size);

    if ((ret = _IsValidFlashRegion(u32Addr, u32Size, u32CmdMask)) != 0)
        return ret;

    u32Addr &= ~NS_OFFSET;

    for (i = 0; i < (u32Size / 4); i++)
    {
        /* write */
        if (_ISPWrite(u32Addr, pu32Data[i]) != 0)
        {
            ret = ERR_ISP_WRITE;
            break;
        }

        /* verify */
        if (_ISPRead(u32Addr) != pu32Data[i])
        {
            ret = ERR_ISP_WRITE;
            break;
        }

        u32Addr += 4;
        ret = 0;
    }

    FMC_DISABLE_AP_UPDATE();
    FMC_DISABLE_LD_UPDATE();
    return ret;
}

/*
    Stage 3.
    Valid commands:
        "CMD_RESYNC"         "CMD_DISCONNECT"
        "CMD_GET_VERSION"    "CMD_RESET"
        "CMD_WRITE"          "CMD_ERASE"
        "CMD_SET_MASS_WRITE" "CMD_MASS_WRITE"
        "CMD_READ_CONFIG"    "CMD_UPDATE_CFG"
        "CMD_READ_OTP"       "CMD_WRITE_OTP" // Do NOT use "CMD_WRITE_OTP"
        "CMD_SET_REGION_LOCK"
        "CMD_XOM_SET"        "CMD_XOM_ERASE"
        "CMD_ERASE_KPROM"    "CMD_SET_KPROM"     "CMD_AUTH_KPROM"    "CMD_KPROM_STS"
        "CMD_GET_RAND_IV"    "CMD_SET_RAND_IV"   "CMD_GET_ID_SIGNATURE"
        "CMD_IDENTIFY_SERVER"
        "CMD_MASS_ERASE"
        "CMD_SET_NS"
*/
int32_t ParseCommands(ISP_INFO_T *pISPInfo)
{
    /* The CMD_PACKET_T is allocated on the Stack. Since the Stack is default mapped to DTCM in BSP,
       any memory accesses bypass the D-Cache, naturally avoiding cache coherence issues. */
    CMD_PACKET_T        cmd;
    volatile int32_t    ret = 0, cmd_case;
    uint32_t            u32Addr, size;
    uint32_t            msg[8], R[8], S[8];
    ECC_PUBKEY_T        PubKey;

    memset(&cmd,             0x0, sizeof(CMD_PACKET_T));
    memset(pISPInfo->rspbuf, 0x0, sizeof(pISPInfo->rspbuf));
    memset(msg, 0x0, sizeof(msg));
    memset(R, 0x0, sizeof(R));
    memset(S, 0x0, sizeof(S));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));

    memcpy(&cmd, pISPInfo->rcvbuf, sizeof(cmd));

    do
    {
        /* plaint text cmd */
        if (cmd.u16CmdID == CMD_RESYNC)
        {
            cmd.au32Data[0] = STS_OK;
            cmd.u16Len      = (4 * 1);
            ret = cmd.u16CmdID;
            pISPInfo->IsConnectOK = 0;
            break;
        }

        if (CMD_ParseReqPacket(&cmd, pISPInfo) != 0)
        {
            DBG("*** [Parse error: 0x%x] ***\n", cmd.u16CmdID);
            memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

            cmd.au32Data[0] = ERR_CMD_CHECKSUM;
            cmd.u16Len      = (4 * 1);
            ret = -1;
            break;
        }
        else
        {
            cmd_case = cmd.u16CmdID;

            switch (cmd_case)
            {
                case CMD_DISCONNECT:
                    CMD_DBG("[CMD_DISCONNECT] (stage 3)\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

                    cmd.au32Data[0] = STS_OK;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    pISPInfo->IsConnectOK = 0;
                    break;

                case CMD_GET_VERSION:
                    CMD_DBG("[CMD_GET_VERSION]\n");
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));

                    cmd.au32Data[0] = STS_OK;
                    cmd.au32Data[1] = LIB_VERSION;
                    cmd.u16Len      = (4 * 2);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_ERASE:
                    CMD_DBG("[CMD_ERASE]\n");
                    ret = _PageErase(cmd.au32Data[0], cmd.au32Data[1], pISPInfo->u32CmdMask);
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = (ret == 0) ? STS_OK : ret;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_WRITE:
                    CMD_DBG("[CMD_WRITE] (0x%x, 0x%x, 0x%x)\n", cmd.au32Data[0], cmd.au32Data[1], cmd.au32Data[2]);
                    u32Addr = cmd.au32Data[0];
                    size = cmd.au32Data[1];
                    ret = _WriteFlash(u32Addr, size, &cmd.au32Data[2], pISPInfo->u32CmdMask);
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = (ret == 0) ? STS_OK : ret;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_SET_MASS_WRITE:
                    CMD_DBG("[CMD_SET_MASS_WRITE] (0x%x, 0x%x)\n", cmd.au32Data[0], cmd.au32Data[1]);
                    ret = _IsValidFlashRegion(cmd.au32Data[0], cmd.au32Data[1], pISPInfo->u32CmdMask);

                    if (ret == 0)
                    {
                        pISPInfo->tmp0[0] = cmd.au32Data[0]; // store write address
                        pISPInfo->tmp0[1] = cmd.au32Data[1]; // store write data length
                        FMC_DISABLE_AP_UPDATE();
                        FMC_DISABLE_LD_UPDATE();
                    }

                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = (ret == 0) ? STS_OK : ret;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

                case CMD_MASS_WRITE:
                    CMD_DBG("[CMD_MASS_WRITE]\n");
                    u32Addr = pISPInfo->tmp0[0] + (cmd.u16PacketID * 48); // maximum data length is 48
                    size = cmd.u16Len;
                    ret = _WriteFlash(u32Addr, size, cmd.au32Data, pISPInfo->u32CmdMask);
                    memset(cmd.au32Data, 0x0, sizeof(cmd.au32Data));
                    cmd.au32Data[0] = (ret == 0) ? STS_OK : ret;
                    cmd.u16Len      = (4 * 1);
                    ret = cmd.u16CmdID;
                    break;

